In [146]:
#Importing libraries:
import pandas as pd
import numpy as np

In [150]:
#Reading the dataset:
df = pd.read_csv("Salary_Data ML-2.csv")

In [152]:
#Displaying the DataFrame:
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [154]:
#Check for Missing Values:
df.isnull().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [156]:
#Remove Rows with Missing Values:
df.dropna(inplace=True)

In [158]:
#Encode Categorical Variables:
from sklearn.preprocessing import LabelEncoder
for i in df.columns:
    if df[i].dtype == "object":
        le = LabelEncoder()
        df[i]=le.fit_transform(df[i])

In [160]:
#Display Processed DataFrame:
df

       Age  Gender  Education Level  Job Title  Years of Experience    Salary
0     32.0       1                0        175                  5.0   90000.0
1     28.0       0                3         18                  3.0   65000.0
2     45.0       1                5        144                 15.0  150000.0
3     36.0       0                0        115                  7.0   60000.0
4     52.0       1                3         25                 20.0  200000.0
...    ...     ...              ...        ...                  ...       ...
6699  49.0       0                5         33                 20.0  200000.0
6700  32.0       1                2        115                  3.0   50000.0
6701  30.0       0                1         41                  4.0   55000.0
6702  46.0       1                4         96                 14.0  140000.0
6703  26.0       0                2        117                  1.0   35000.0

[6698 rows x 6 columns]

In [166]:
# Split Features and Target:
x = df.iloc[:,:-1]
y = df.iloc[:,-1]

In [168]:
# Train-Test Split:
from sklearn.model_selection import train_test_split
xtrain, xtest, ytrain, ytest = train_test_split(x,y,train_size=0.80,random_state=52)

In [170]:
#Train Linear Regression Model:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(xtrain,ytrain)
yp=model.predict(xtest)

In [174]:
#Evaluate Model:
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error
r2_score(ytest,yp)

0.6790202994594187

In [176]:
# Evaluate Mean Absolute Error:
mae = mean_absolute_error(ytest, yp)
print("Mean Absolute Error (MAE):", mae)

Mean Absolute Error (MAE): 24004.25648073033

In [178]:
# Evaluate Root Mean Squared Error
rmse = np.sqrt(mean_squared_error(ytest, yp))
print("Root Mean Squared Error (RMSE):", rmse)

Root Mean Squared Error (RMSE): 29913.92288424504